name: "softmax_test"

layer {
  type: 'Python'
  name: 'loss'
  top: 'loss'
  bottom: 'previous_layer'
  bottom: 'label'
  python_param {
    # the module name -- usually the filename -- that needs to be in $PYTHONPATH
    module: 'softmax'
    # the layer name -- the class name in the module
    layer: 'SoftmaxWithLoss'
  }
  # set loss weight so Caffe knows this is a loss layer
  loss_weight: 1
}
